app/Controllers/Aset.php

    public function edit($id = null)
    {
        $aset = $this->aset->find($id);
        if (is_object($aset)) {
            $data['aset'] = $aset;
            $data['unit'] = $this->unit->findAll();
---
SELECT *
FROM `unit`

            'tahun_perolehan' => $this->request->getPost('tahun_perolehan'),
            'usia' => $this->request->getPost('usia'),
        ];
        $this->aset->update($id, $data);
---
UPDATE `aset` SET `id_unit` = '4', `form_bast` = '1699347397_cc1ba9f5721e04435556.pdf', `no_aset` = 'Tes', `desc_aset` = 'tes', `lokasi` = 'tes', `user` = 'tew', `foto_aset` = '1699347397_8b4a53393363de706768.jpg', `tahun_perolehan` = '2023-09-01', `usia` = '12', `updated_at` = '2023-11-07 21:14:33'
WHERE `aset`.`id_aset` IN ('2')