app/Controllers/Auth.php

    public function loginProcess()
    {
        $post = $this->request->getPost();
        $query = $this->db->table('users')->getWhere(['username' => $post['username']]);
---
SELECT *
FROM `users`
WHERE `username` = 'admin123'

    public function register()
    {
        if (session('id_user')) {
            return redirect()->to(site_url('home'));
        }
        $data['unit'] = $this->units->findAll();
---
SELECT *
FROM `unit`