app/Models/AsetModel.php

SELECT *
FROM `unit`
JOIN `aset` ON `aset`.`id_unit` = `unit`.`id_unit`
---
    function getAll()
    {
        $builder = $this->db->table('unit');
        $builder->join('aset', 'aset.id_unit = unit.id_unit');
        $query = $builder->get();